app/controllers/thresholds_controller.rb

    def show
        if params["data"] and params["sig"]
            data = JSON.parse(Base64.urlsafe_decode64(params["data"]))

            signature = Base64.urlsafe_decode64(params["sig"])
            signature_check = OpenSSL::HMAC.digest("sha256", GEOPOD_CONFIG[:consumer_secret], params["data"])

            if signature != signature_check
                render :nothing => true, :status => :forbidden
            end

            # Check the signature here
            if data["subdomain"]
                @geopod = Geopod.find_by_subdomain(data["subdomain"])
---
SELECT "geopods".* FROM "geopods" WHERE "geopods"."subdomain" = 'test-geopod' LIMIT 1

    def data
        point_ids = params.has_key?("points") ? params["points"] : []
        start_date = params.has_key?("start") ? params["start"] : Date.today.strftime("%Y-%m-%d")
        end_date = params.has_key?("end") ? params["end"] : Date.today.strftime("%Y-%m-%d")

        subdomain = params["subdomain"]
        if not subdomain then render :nothing => true, :status => :bad_request end
        geopod = Geopod.find_by_subdomain(subdomain)
---
SELECT "geopods".* FROM "geopods" WHERE "geopods"."subdomain" = 'test-geopod' LIMIT 1

    def auth
        if request.post?
            if params[:subdomain]
                geopod = Geopod.find_or_create_by_subdomain(:subdomain => params[:subdomain])
                geopod.name = params[:name]
                geopod.access_token = params[:access_token]
                geopod.access_token_secret = params[:access_token_secret]
                geopod.save
---
INSERT INTO "geopods" ("name", "subdomain", "access_token", "access_token_secret", "created_at", "updated_at") VALUES (NULL, 'test-geopod', NULL, NULL, '2011-05-03 14:21:50.933693', '2011-05-03 14:21:50.933693')
SELECT 1 FROM "geopods" WHERE ("geopods"."subdomain" = 'test-geopod') AND ("geopods".id <> 1) LIMIT 1
UPDATE "geopods" SET "name" = 'Test Geopod', "access_token" = 'yMesB49RMRrGF5rQfF', "access_token_secret" = 'hLXkdgbbb44ADR7QgAtCzTPydyRSbPxr', "updated_at" = '2011-05-03 14:21:50.961219' WHERE "geopods"."id" = 1